tap 'homebrew/bundle'
tap 'homebrew/core'

#System tools
brew 'grep'
brew 'unrar'
brew 'speedtest-cli'

# Development & Power tools
cask 'iterm2'
cask 'visual-studio-code'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'git' # no force-bottle: git --exec-path doesn't work, remote helpers missing from path
brew 'go'
brew 'composer'
brew 'node'
brew 'yarn'
brew 'wget'
cask 'ngrok'
# brew 'postgresql'
brew 'mysql'
brew 'heroku'

## For React Native
brew 'watchman'

# Desktop Software
cask 'spectacle'
cask 'firefox'
cask 'brave-browser'
cask 'opera'
cask 'bitwarden'
cask 'vlc'
cask 'skype'
cask 'discord'
cask 'telegram'
cask 'the-unarchiver'

# Containers 
# cask 'docker'
