tap "homebrew/bundle"
tap "homebrew/core"

# CLI Tools
brew "git"                # Distributed version control system for managing source code.
brew "node"               # JavaScript runtime used for backend and frontend development.
brew "fnm"                # Fast Node.js version manager (modern alternative to nvm)
brew "mongodb-community"  # Community edition of MongoDB, a NoSQL document database.
brew "jq"                 # Lightweight command-line tool for processing and querying JSON data.
brew "yq"                 # Command-line YAML processor, similar to jq but for YAML files.
brew "fzf"                # Command-line fuzzy finder to quickly search through files and history.
brew "htop"               # Interactive process viewer and system monitor.
brew "diff-so-fancy"      # Improved diff output that’s easier to read in the terminal.
brew "romkatv/powerlevel10k/powerlevel10k"   # Powerlevel10k theme for Oh My Zsh
brew "httpie"   # Modern, user-friendly command-line HTTP client (cURL alternative)

# Apps
cask "iterm2"                 # Powerful terminal emulator for macOS.
cask "visual-studio-code"     # Lightweight source code editor optimized for web development.
cask "orbstack"               # Fast, lightweight Docker alternative for running containers and VMs on macOS.
cask "slack"                  # Team communication and collaboration tool.
cask "spotify"                # Popular music streaming application.
cask "rectangle"              # Window manager for organizing windows with keyboard shortcuts.
cask "google-chrome"          # Fast and widely-used web browser from Google.
cask "zoom"                   # Video conferencing and virtual meeting tool.
cask "figma"                  # Collaborative interface design and prototyping tool.
cask "bruno"                  # Open-source API client alternative to Postman.
cask "vlc"                    # Versatile media player supporting most audio and video formats.
cask "aldente"                # Battery charge limiter to extend MacBook battery health.
cask "tableplus"              # Modern, native GUI tool for managing SQL and NoSQL databases
cask "termius"                # Modern SSH client with cloud sync.
cask "the-unarchiver"         # Utility to open various archive file formats.
